[
{"name": "Bessie", "date": "2nd June 2019", "text": ["Ok I hope I don’t upset anyone but in really self conscious we were in drama and a bunch of boys said that they want me to suck their cock and then they followed me home after the lesson each touching my breasts and my thighs I told them to stop but then they said that no one would believe me if i told them because I’m to ugly to be raped .I have tried extremely hard to lose weight as I am the fattest and ugliest out of all of my friends.I  am sorry if I offend anyone I’m 13 by the way"], "tags": []},
{"name": "Creepy old men", "date": "2nd June 2019", "text": ["Married very old  friend of my dads thought my polite two minute conversation meant he was in with a chance followed me home to see where I lived and posted a love letter basically saying I belonged to him and he to me.", "\nHe’s about fifty years older than me but hey talking politely to your dads workmate one one occasion is a massive come on isn’t it?", "\nLol I still live with my dad as we moved so he didn’t realise my dad lives here too, very glad he does, I showed him the letter.", "\nTwat.", "\nPresumptuous creepy adulterous twat. Not a compliment.", "\nSad how happy I am that I live with my dad most men find it such a put off and good because it keeps them away.", "\nI’ve only recently learnt it’s ok to tell men like this to fuck off, I was too polite to older men because they are old, not any more. If they are creepy they will get called out."], "tags": ["Public space"]},
{"name": "Dumb", "date": "2nd June 2019", "text": ["A couple of years ago", "\nWe did a pub quiz and I got a load of crap for not knowing celebrity gossip – who’s dating whom?", "\nI just got all the science ones right but that’s not good enough", "\nIt’s not like they don’t know I was doing a science degree and had been seen with a massive physics book !", "\nUnlike my male quizzmates who watched endless trash tv one had no gcse s at all, and the other had rubbish A level – low grades and retakes incuding media studies. ", "Which ones would you expect to know the shit non academic questions? The girl apparently! Cos girls like romance innit!", "\nBut it was still my fault even though I hate quizzes and was making up the number s to do them a favour… never again."], "tags": ["Public space"]},
{"name": "London", "date": "2nd June 2019", "text": ["Twenty years ago", "\nMy Muslim friend was married off at 12 by her dad on holiday", "\nWe got a postcard never saw her again", "\nHe didn’t like her hanging round with Christians", "\nChristophobia  and sexism.", "\nApparently 12 years free education in England is more than enough for a girl to look classy and be a helpful English speaking wife then back to Pakistan"], "tags": ["School"]},
{"name": "Oddball neighbour", "date": "2nd June 2019", "text": ["I have been emailed by a neighbours  husband in a weird way the email came from his email address not hers but obviously he got my email address from her. I actually don’t know what to do about this now I saw them both together last week and it’s gone from “that nice couple” to wtf mind games does she know he sent that random massage offer?", "\nI now feel really uncomfortable but on the surface it was  same as before nice smiley neighbour couple, come in anytime, come and sit down only I don’t really want to be alone with him… I’m just out of hospital and quite frail I don’t need this , I tried to pretend I hadn’t seen them but he saw me stagger past and called me over – they only live 15 metres away and he’s offering massages? Just odd and creepy.", "\nHe’s not a masseuse. It seemed really inappropriate. Maybe I’m paranoid as I’ve been sexually assaulted in past and also had problems with inappropriate and random post op. massage offers that escalate before –  it seems to be a thing with healthy men on sick women.", "\nI showed a friend and she totally thought it was a come on. So it wasn’t just me.", "\nHere we go again, do I ask the wife if she knows he offered whilst telling me he wasn’t any good at massage but wanted to practise?", "\nPlease guys stop doing this! Use some sensitivity. If I wanted a massage I’d get the district nurse in or my mum.", "\nI went into polite mode and he was just smiling at me while she chatted so I think she doesn’t know and part of me thinks it’s a kinky power trip. And yet honestly he seems friendly and ok too, so maybe he’s just clumsy and clueless. Don’t want to cause trouble for this couple or jump in blaming anyone.  I just don’t know whether to mention it again and I’ve tired of having to work this stuff out….", "\nI’m sure some healthy men might get similar odd offers from married women but you can be a lot more assertive when you are well… it does seem to be sick women getting them from healthy men when we can’t exactly run far or fast..,,", "\nIs this sexism ? Do sick men get this?", "\nI know which gender is most likely to perpetrate sexual assault and really that should be a factor to think about before you send an email offering your amateur physical services to your neighbour.", "\nIf I  wanted medical massage he knows full well I could get it off my mum.  It must be a come on. How odd. How creepy. Does she know and do I say? If I mention it to my mum I know she’ll just say it’s not a thing and not cause a fuss.", "\nFeel a bit less safe, thanks"], "tags": ["Home"]},
{"name": "Matilda", "date": "2nd June 2019", "text": ["the first time i was catcalled i was 12 in my school uniform waiting for a bus. i was told to “sit on my face slut”. i was raised to stand up against sexism so i responded with a get lost. i was then chased by the two 30 year old men in their car for 5 minuets being screamed at and being told what they were going to do to me when they got a hold of me. i have never said anything when catcalled again."], "tags": ["Public space", "Public Transport"]},
{"name": "Nora", "date": "2nd June 2019", "text": ["I was almost driven to anorexia in my teens. I dropped from about 130 lbs to about 110 in 6 months when I was 16 (5’8″, just for perspective), only to be rudely told by friends of my parents that I’m too thin.", "In my 20s, I was constantly unsatisfied with my body, fluctuating between 135 and 150 and always aiming to “get the weight off”", "At 30 I got a wakeup call, and realized that my body’s perfectly healthy and wonderful the way it is.", "Now I’m 33, 145 lbs, pretty active, and never once does it cross my mind that I should lose weight. However, when I mentioned to a fellow musician last week, a woman my age and a little bit thinner than me, that I was trying to eat healthy, she instantly started telling me how I needed to track all my calories and do sports every day and watch the carbs in order to lose weight. I was stunned. I told her, I don’t aim to lose weight. She looked at me blankly and said “really?”", "I’m ashsmed to even say it, but I’ve felt fat ever since she said that. I can’t shake it. I feel every ounce of fat on my body, which until then had felt sexy, now feels like an unwanted blanket. For some reason this comment has affected me deeply. There is something inherently wrong with a society that looks at a healthy body and thinks of it as a problem needing to be solved. (And by healthy body I don’t just mean mine, I mean others who are heavier than average but happy at their size too)"], "tags": ["body image"]},
{"name": "Jen", "date": "2nd June 2019", "text": ["Been dating a guy for a while when I was seventeen one night he’d been drinking before he came round to hang out with me. I’d never been with a guy before and we’d agreed to take things slow. Slowly one thing started leading to the other when it happened I froze up and asked him to stop. His response “we’re already having sex though” he didn’t.", "A few months later on a bus on my way to work with headphones in when I feel a tap on my shoulder and a headphone tugged from my ear. The guy behind me who looked mid to late twenties started telling me I had pretty hair, wanted to know what my name was, where I was going, where I lived, where I worked, if he could come spend time with me. I told him I was seventeen,which I hoped would get him to back off but the dude didn’t bat an eyelid. So I lied said I’d just finished work at a made up cafe, and my dad was picking me up from the bus stop. The dude thankfully backed off after that but stared at me till he got off at his stop.", "Few years later was at a club with group of friends. I’d just left the ladies and was walking by myself to meet my friends by the bar when some guy pinned me against the wall and tried to kiss me. Had to tell him three times to cut it out before he let me go. Worst part is when I looked over his shoulder at my friends one of my guy friends was watching what was happening but did nothing to help even though he knew I was in a relationship and was clearly uncomfortable. Have had another guy try and grab at me in a bar/club but he wasn’t as aggressive about it and backed off pretty quick.", "Current boyfriend’s friends being inappropriate when drunk touching my lower back being too forward even though they all have serious partners and I’m with my boyfriend who’s their friend. ", "Catcalled a couple times, guys mansplain things on a regular basis, and recently had a male colleague look me up and down while passing him in the car park. Not that what I was wearing should matter but was literally wearing jeans a baggy shirt and a jacket. Actually try to dress androgynously to avoid attention and guys been creepy. ", "Sexism is sadly alive and well"], "tags": []},
{"name": "Bill", "date": "2nd June 2019", "text": ["A teenage boy laughingly mocked another teenage boy about chess: “He lost to a female!”"], "tags": ["School"]},
{"name": "Amadala", "date": "2nd June 2019", "text": ["I was going on a jet-ski with my male cousin (we’re both 16), and so came out in my red, beautiful bathing suit (I am very proud of it, it’s my favorite). My mom then says (joking), that I shouldn’t wear that as I’ll distract him from driving. I know she was kidding but it’s still the concept, that I am responsible for his recklessness and he is incapable of self-regulating, that women always have to hide “temptation” from men because they are impulsive apes.. ugh.."], "tags": ["Home"]},
{"name": "Embarrassed", "date": "2nd June 2019", "text": ["We have a supermarket delivery once a week. It is usually a man who delivers it, but not always. We got in to the habit of saying ‘the Man’ is coming. My 6 year old boy called me out on this that it might not be a man. I now get told off if I don’t say shopping delivery instead of shopping man. I feel proud how I’ve brought my son up, but constantly shamed for my own sexism."], "tags": ["Home"]},
{"name": "b", "date": "2nd June 2019", "text": ["… I’m the first women at my school to be a football player. I’m a model who loves fashion and loves sports. Men are awful my coach is awful. I can stick through all that but what I can’t stick through is when people tell me to brush off the coaches sexist remarks. They tell me to stop being so sensitive. I’ve been told to “man up”. I started football because I liked the sport, I continue football for all the girls to follow and the girls that will interact with these men with small minds who believe we can’t amount to what they can."], "tags": ["football", "highschool", "Public space", "School"]},
{"name": "Umist", "date": "2nd June 2019", "text": ["When I was at university I went out one night to a nightclub. As I was leaving one of the bouncers grabbed me and forced me down stairs (through a pin coded door). He molested me. It was only because my friends were calling for me that he stopped. I did nothing about this.", "\nA couple of weeks later he was working at our student union and he tried to do it again. This time I reported it to the student union. A friend witnessed it and came with me. We were told there was nothing they could do as the bouncers worked for an external agency and were dismissed. Looking back I wonder why I wasn’t advised to go to the police, or given help reporting it to the agency.", "\n I wonder how many other girls weren’t as lucky as me in escaping him. If my friends hadn’t kept shouting for me, would I be telling a dit’s story now."], "tags": ["University"]},
{"name": "Clare", "date": "2nd June 2019", "text": ["One night my family and I stopped at a service station to buy petrol. I went in with my dad and my brother, and just as we were going in the door I heard shouting. When I turned around, I saw a women being grabbed by a man and dragged towards his car. At that same moment, another man ran out and pulled the first man off. The woman got away, and I assume her attacked was caught – but I was struck by the fact that my dad, who was right there, didn’t do anything and only continued walking into the store."], "tags": ["Public space"]},
{"name": "Delilah", "date": "2nd June 2019", "text": ["In year 8 I was taking the no. 58 tram to the hospital and a barefoot, bad smelling man approached. He leant over me to write with a pen on the back of the tram stop. I was puzzled and I moved away. He leant over to me and whispered “sshhh” and I said “no problem I won’t tell anyone; it’s cool to write your ideas”. I was kind of mumbling because I was very scared, and I was trying to be polite. He wrote ‘if ur not in denial… then where r u?…’. I was very confused. He randomly turned to me and said “have you ever lost a friend to suicide?” I said that I hadn’t, that I was really sorry, I gave my condolences. The guy says “you know why he died? PAEDOPHILES! AND ALL LESBIANS ARE PAEDOPHILES!” I got very scared, and I said that I really disagreed with him that all lesbians were paedophiles(I’m a lesbian myself). The tram arrived and he walked towards it. He turned around and said “well you’re a lesbian, ya fuckin lesbian slut”, flipped me off, and got on the tram.", "\nI waited for the next tram."], "tags": ["Public Transport"]},
{"name": "Max", "date": "2nd June 2019", "text": ["One of my friends was getting messages from this guy online who she’d never met, she didn’t know what he looked like, how old he was, where he lived, nothing. He was continually asking her for nude pictures and she was saying no. She gave me her phone to read through the messages and he had said to her “it doesn’t matter if you said no to sending pics I said yes and I want your nudes so you have to send them.” She told me that she gets a lot of these messages from guys. It makes me think that even though it’s all online and they can’t really hurt her. What if they’re like this in real life. They just think that they have the right to a girl’s body no matter", "\nwhat she says. I worry that they might assult someone irl and there’s nothing we can do to stop it."], "tags": []},
{"name": "Sofia", "date": "2nd June 2019", "text": ["My classmate touches my thigh :/ and I don’t feel comfortable with it tbh"], "tags": ["School"]},
{"name": "Sofia", "date": "2nd June 2019", "text": ["An older man old enough to be my father was stalking me and asking me to marry him and go with him and no one did anything and let me tell you there were tons of people in the street yet no one helped me until I asked for him because it was needed . People suck. Society suck. Be strong y’all! Be the change you wanna see."], "tags": ["Public space"]},
{"name": "N", "date": "2nd June 2019", "text": ["Im a guy, and a few months ago, my closest friend (female) was sexually assaulted. Her (abusive) ex was in town visiting her (family friend, against her will). I knew all about him and what he’d done before, but somehow he took her phone and ended up texting me, we had a whole convo, where I tried to flush him out as still abusive – more recently she believed he’d changed. He openly said he’d “do” her even if she said no. After he left, I texted her for a while but I didn’t mention it, I just talked about some petty drama from school. ", "A few minutes into our convo she left, i had no idea where, and the next morning, she didn’t talk to me at all, when we had an internship together. At the end of the day she said “i shoulda told her” and she said he forced her to do some extreme things, and only a few days later I found out it was r***. To this day I still regret not having told her before. She finally forgave me, and I’ve always been super cautious, I tell her every time I’m worried about this happening. ", "Thank you for listening guys, IMO tho we can’t change what they do, another incident was her best friend visiting her and saying he’d do the same thing, this time I begged him not to on text, and he still went ahead carelessly. I’ve tried so much to change it in my power though as I can’t control their actions."], "tags": ["Home", "School"]},
{"name": "Caro", "date": "2nd June 2019", "text": ["I was just walking to work down the high street in Guildford, Surrey and in front of me was a regular middle aged man; overweight, balding, wearing shorts and one of those Bluetooth ear pieces. Fairly standard. There was a rather glamorous young woman in her early 20s walking up the hill towards us wearing very tight black leather trousers. After she walked past he turned to look at her, saw me watching him and then turned away and shook his head as if he actually disapproved of what he’d just seen (Yeah right!). So I also turned to look at what this dreadful sight might be! I saw nothing bad, only a great bum in some tight trousers. I started laughing cos he clearly had looked again for that reason! Then the woman walking next to me saw my face and said “Did you just see his reaction?!” And we both started laughing and talking about how he clearly didn’t dislike what he had just seen. She said “Men are like magnets; they all point in one direction”."], "tags": ["commute", "disapprove", "high street", "Public space"]},
{"name": "Marie", "date": "2nd June 2019", "text": ["Just had a delivery man get out of his van on the highstreet- I was walking past him and noticed he was staring / glaring at me. I carried on minding my own business to which he shouted ‘Woof!’ aggressively? Ooookay. Thanks for calling me a dog out of nowhere to a complete stranger. Oh and he himself was fat and ugly."], "tags": ["Public space"]},
{"name": "Bill", "date": "2nd June 2019", "text": ["Two teenage boys are having a friendly conversation.", "One gets up to go to class.", "As a parting comment, he light-heartedly says to the other: “I’m going to fuck your ho, bitch.”"], "tags": ["School"]},
{"name": "G", "date": "2nd June 2019", "text": ["Just read story from Marta about having her breast squeezed by a woman and have experienced the same, I was so gobsmacked I didn’t even tell the woman off! Total stranger, drunk and jealous because I have a big chest which I always keep completely covered – I don’t find cleavage attractive probably because I’ve got a lot of it . I’ve been groped and full on sexually assaulted by males a few times but only once by a woman.", "\nSeriously people they are for feeding babies that’s it.", "\nDrunk small boobed straight woman “wanted to know if they were real” so obviously had to check directly apparently.", "\nI blame the medias sexism- fetishising breasts as much as the thick entitled people.", "\nUnless you are a massive exhibitionist like most celebs there is no joy in having big boobs. There is no correlation either between having a big chest and being tarty or loud. I’m not a stripper sex worker page 3 etc etc I’m not after your boyfriend. I wear no make up and cover up yet still I got all that crap from both genders.", "\nJust try to see big boobed women as people. And don’t tell me how “lucky”  I am.", "\nI even had a man I’ve never met before tell me he’d like to put his head between my breasts he wasn’t even drunk."], "tags": ["Media", "Public space"]},
{"name": "S", "date": "2nd June 2019", "text": ["It’s about 7.45 as I walk into my local coffee shop. I say hello to B and pass my refillable cup to the guy who is serving today. There is no-one else in at the moment. ", "B is a regular so I ask him how he is. Response ‘a bit cold but once I have had this coffee I will have warmed up to come over and sexually assault you’", "B is in his 80’s and doesn’t speak that clearly and I think I have misheard hims so I ask him to repeat himself please. He does. Same words. ", "B follows with ‘how would you feel about that?’ ", "My brain catches up and I say something along the lines of ‘I would punch you.’ …. ‘in fact I am offended that you think you can say something like that to me’", "I pay for my coffee and leave rapidly. ", "I follow up with the owner. I report to the police. I am stunned that someone I say hi to reasonably often thinks he can say this. I don’t think it is coincidence that it has happened on a day when the barista is male and there are no other customer s in at this point."], "tags": ["Public space"]},
{"name": "Poppy", "date": "2nd June 2019", "text": ["My Dad said my Mum will have to set up a ‘new little kitchen’ because the current kitchen will be destroyed when extension is built – why is the kitchen my Mum’s? Do you not need and use the kitchen? Whose attachment to the kitchen allows for your detachment?"], "tags": ["Home"]},
{"name": "Sophie", "date": "2nd June 2019", "text": ["At my job tearing tickets at the movie theater, an older man jovially pulled his ticket away as I tried to take it. I forced a thin smile and waited for him to give me the ticket. After I tore it and handed it back, he put his arm around my underage, 17-year-old shoulder and asked “Will you be my date?”", "I nervously muttered “No,” and might have given an awkward laugh. He and his friend chuckled as they left. The rest of the night I was so angry at myself for not telling him off or pushing him away. I still feel shaken up when I remember it."], "tags": ["Workplace"]},
{"name": "Anne", "date": "2nd June 2019", "text": ["I was walking home from a night out with my best friends. It was about 3 am and raining heavily so I had draped my jacket over my head. I heard a whistle behind me but shrugged it off, I thought it either wasn’t directed at me or that if it was, I would not want to give that human being any attention. After a couple of seconds I decided to cross the street and let anyone walking behind me pass before continuing, just to be safe. There was a guy walking behind me and he walked past where I was standing. After about 20 meters he turned around and started to talk to me. When I didn’t answer (obviously frightened and not in the mood) he asked if I had a weak character. At this point I lost it. I told him that most importantly, I had a pepper spray and that he should leave me alone. He walked away mumbling and I screamed if it were funny to frighten women.", "\nUnfortunately, my story doesn’t end there.", "\nI was still standing in the same spot, kind of huddled over in order to keep my jacket on my head whilst simultaneously trying to call a friend (I wanted somebody to talk to for the rest of my way home).", "\nThis is when a group consisting of 2 girls and 1 guy passed.", "\nAll that guy had to say was “Stand upright” as if I wasn’t on the verge of crying and obviously having some kind of problem.", "\nI did not expect him or them to help me, but is it too much to ask to shut your mouth?"], "tags": ["harassment", "Public space", "Sexism", "walking home"]},
{"name": "hhhh", "date": "2nd June 2019", "text": ["THE city Ivrea and canavese area,(piemonte turin) I mean all men I met all sexists..(extremely malicious, and unpleasants)..inside the offices..is unbelivable…", "\nbut the women here them do not argue..", "\nnot all women are respected..only the one who has a nice body, nice houses, and perfect perfil has not problem…", "is not pleasant working with men extremely close to…and watching you from the top to the bottom…", "\nIf you are not like exactly a barbie…them take a piss of you for the entire life..(them keep the old pics) of your adolescents…and show them to all around to laugh at you…", "then them taking a piss also of your families members…obviously behind the shoulder", "..them take a piss of your surname, defects, and smiling at you as a piece ofXXX…etc etc..absolutely a nasty place for a girl, or women to live…", "\nESPECIALLY iF IS FROM another area (center or south)…", "\npiemonte zone (north of italy)", "\nAbsolutely awful, and nasty…", "\nIf some nice women and men from abroad can change this place.", "just keep this anonimously…"], "tags": ["Public space", "School", "Workplace"]},
{"name": "Tara", "date": "2nd June 2019", "text": ["A guy had sex with me without a condom despite me telling him to, this was an essential part of the terms of consent and he ignored it. He said it was easily remedied by getting the morning after pill."], "tags": ["Home"]},
{"name": "fabrizio", "date": "2nd June 2019", "text": ["since little, I had lots of bullet girls who nastyly damaged me…but seems no-one care..", "\nso, I give up..explain (men do not cares) and women neither…so, whats the point in this society?", "I went abroad to stay alone, but no-way to be stalked and molested…dont know what to think…", "\nthen I read there are some women, who pretend to help other women, but absolutely dont give a damn…", "docotors who damaged me, basically pervert, w-out money..all that happen in a little montain town, where all are absolutely fake, and not helpfull, ", "IVREA TURIN ITALY…", "\nLOT OF MAFIA, AND SNOBBISH PEOPLE…", "\n(SEXISTS, MALICIOUS MEN, AND WOMEN)", "\nTHERE ARE IN A GANGS GROUPS…(I’M NOT TALKING ABOUT CARNIVAL WHICH IS FAMOUS HERE)", "\nI’M TALKING ABOUT THE REAL PEOPLE, I MET…AWFUL", "\nMOST OF PEOLE GO AWAY, OTHER LIKE ME HAS TO STAY..NO MONEY TO MOVE IN ANOTHER REGION…"], "tags": ["Media", "Public space", "Public Transport", "School", "Workplace"]},
{"name": "Claudia", "date": "2nd June 2019", "text": ["As a teacher, I have noticed that whenever I or other female teachers are assertive, students (both male and female) complain that we are too bossy, but when male teachers go beyond assertive to being bossy and aggressive students just follow along like little lambs and think they are the best teacher ever.", "Society trains kids be very resistant to assertive women and also, dangerously, to follow accept male aggression without question."], "tags": ["School", "Workplace"]},
{"name": "Izzy", "date": "2nd June 2019", "text": ["i love football, boxing, running but when ever i beet the boys apparently they were ‘going easy on me.’ when we played football if my team had all the older players they would all moan. until they saw me. ‘oh its fine they have a girl.’", "\ndon’t let people be sexist to you!"], "tags": []},
{"name": "Nishtha", "date": "2nd June 2019", "text": ["I got a short hair cut. In other words : a boy cut. An office colleague said , a woman’s beauty lies in her hair so how can i do this to myself. later i met a person for marriage proposal. He first asked me why i have short hair and pointed to a girl with long hair praising her beauty. He then asked me what kind of husband i am looking for. I just said one who does not judge me by my hair!"], "tags": ["Media", "Public space", "Workplace"]},
{"name": "Jess", "date": "2nd June 2019", "text": ["I was sexually targeted by a male coworker, a few years older to me, on a 3-week programme. I rejected his advances but he did not take notice, he continued to pull me aside to tell me that I looked sexy, I would catch him ogling over me while I was working, and he told me that despite being in a committed relationship, I could call him up anytime to do something on the side. One evening he invited me to his room where all the staff were staying and tried to kiss my neck, and I was frozen. It was awful.", "\nI was angered by the fact that none of what happened had to do with me, but with him seeing me as an instrument to his sexual pleasure/desire, and he assumed that I would be submissive to his wishes. He even tried to contact me on social media after this, and I was kind, but eventually blocked him. Many months later he found me on a different platform, so I have blocked him again. ", "I was embarrassed that I couldn’t stand up for myself, and I overlooked the situation which goes against what I stand for. But I have learned to forgive myself and acknowledge that I was being manipulated and that I needed time. I also have to remind myself that I said no and continued to be a nice person, but it didn’t work, so I have to work around that. I’m learning how to feel empowered and how to stomp on the men who sexualise me without my consent. I’m also trying to figure out my boundaries of feeling sexy and feeling sexualised."], "tags": ["Workplace"]},
{"name": "Laney", "date": "2nd June 2019", "text": ["I’ve grown quit used to being stared at and hearing conversations from males about what they wish they could do to me. I have two stories that quit bug me but I feel  I can’t share with my friends. Keep in mind at the time I was 13. I was in school getting my stuff out of my locker and some guys in my grade walked up to me. I was on my knees because my locker was on the bottom. The guys weren’t to close to me but I could hear them quite clearly. One of the boys said I wish she was on her knees like that for me and they all laughed. I ignored it and kept getting my stuff. Then one off the boys approached me. I couldn’t stand up because he was leaning over me. I’m quite short but even if I had stood up he was leaning over me so far I would of hit him. He said my full name which I never tell anyone and continued to tell me how “hot” I was. I was getting very uncomfortable so I asked him to please step away and give me my space he did and without having all my stuff I got up and left.  Then a few weeks later I was walking in the hallway. I was the only girl there so I knew they where referring to me. The same guys where behind me and I heard one of them explaining how hot and “fine” I was. Nothing else happened but even the male teacher standing by heard and ignored it. My next story takes place at the gym about two days later. I’m a cheerleader and was working on my dance in the studio. The studio walls are made of tinted glass so you could clearly see in. There was a man on a machine watching me while I was working out. I was wearing a sports bra and some spandex and he kept staring. I was getting uncomfortable because the man was at least 20 years older than me. He then proceeded to take out his phone and film me. I got up and left the studio and while I was walking away he cat called me. I got very uncomfortable and left as soon as I could. I know my story isn’t as bad as others but it happened and with this website I hope we can share awareness about this stuff."], "tags": ["gym", "School"]},
{"name": "Natalya", "date": "2nd June 2019", "text": ["In Turkey, on holiday. Tried to get a trolley from the pile in airport as free like supermarket trolley at home. Already some man starts flailing at me and mum expecting to be “paid” in tip! I was too polite to say çildirmak (Feck off!) or dişari ördek  (duck out)  and instead waved him aside muttering “go away, you onion!”.", "\nNoticed 3 minutes later, that same man didn’t go to this other man getting an airport trolley. Why us? 😔 we can do our trolley by ourselves perfectly fine.  I think it is because I stand out because of my pale coffee skin and green eyes and mum’s dark (she’s Black Caribbean with brown eyes)"], "tags": ["Public space"]},
{"name": "Kimberly", "date": "2nd June 2019", "text": ["It’s happens a lot in Vietnam where schools would write on Facebook that they are only interested in males or females for teaching English."], "tags": ["School"]},
{"name": "Grace", "date": "2nd June 2019", "text": ["I raised a simple IT issue with an IT guy at work who has a habit of talking down to me and patronising me.", "Me: I can’t rename a file, it keeps saying it’s open but it’s not.", "\nIT: It’s because someone has it open in preview, that’s why.", "\nMe: No, no-one was even looking at the file when I tried to rename it, that was one of the first things I checked.", "\nIT: No, I know what I’m talking about, that’s definitely the problem.", "I can guarantee that will not be the reason, but he won’t listen to me that I checked it.  I know he doesn’t say stuff like that to my colleague when he raises issues."], "tags": ["Workplace"]},
{"name": "James smith", "date": "2nd June 2019", "text": ["I personally called out another male staff member about his sexist comments in work, and now my boss is making me feel like Im in the wrong and should forgive him!? NOT A CHANCE! ANY HELP?"], "tags": ["Workplace"]},
{"name": "Karli", "date": "2nd June 2019", "text": ["I’m on the EBoard for one of the largest organizations on my university campus. I’ve been invited to work with this organization’s national staff. I’ve been in this organizations for 6 years. I’m currently running for a seat on the organization’s national officer team.", "So, why do the male administrators at my university wave me off during meetings but praise the male student members when they repeat (almost verbatim) the ideas I’ve already suggested?"], "tags": ["University"]},
{"name": "Amanda", "date": "2nd June 2019", "text": ["An older man, who has known me since I was a little kid, run into me before new year`s eve. He asked about my job etc. and also about my plans for new year etc. I told him I had no plans, because I have to stay at home at new year`s eve.", "\n“oh, because of the baby” – he instantly assumed (I do not have children).", "\nI said “No, because of my cats. The are affraid of fireworks”", "\n“You need a man and a child!” – he screamed at me. Literally screamed.", "\nI told him that I do not need a man in my life. ", "Why does an almost stranger think he has the right to tell how I shoudl live my life? Woudl he have done it if I was a man? No."], "tags": ["Home", "Public space"]},
{"name": "Strong", "date": "2nd June 2019", "text": ["This one day it was break time, so I and my best friend decided to walk around the track. My best friend was dressed very nicely because she loves clothes, and as we started walking one guy from our grade (7th) called her out, saying “Dam… looking nice with your ass”. We just laughed and brushed it off, because I thought it was just usual. But now I regret not turning back and saying “yo say that one more time and ill bust your lips.”. especially since my friend does not speak English, and I feel guilty. But now I know that the next time it happens I won’t brush it off because it is not okay."], "tags": ["School"]},
{"name": "Strong", "date": "2nd June 2019", "text": ["I love sports so I decided to take a gym class, and usually, we are placed in teams with a random captain. But this time I was not picked captain because I did not want to be one, so the teacher placed me in a group. This day we were playing soccer, and I was placed in a group with the “usual”, and he did the same usual thing. Well, this thing he always does is just assume that I suck at sports and that all girls in the class sucked at sports. But I do not suck at soccer, I had more experience especially since I was in the girls (A) soccer team, the best team. But still without asking for my experience, he said that I should play defense even though I was very good at forward, so I told him that I was going to be the forward with him and the other guy. He could into do anything so he let me play when we got started he never passed the ball to me, even though I would pass the ball to him when I was surrounded. he would rather lose the ball then pass it to me. So I decided it was no more, and I started playing dirty as he did. Whenever I got the ball and he yelled out I would ignore him, and shook for a goal, even though I knew I would not make it. Whenever he also got the ball I would attack him, getting and no one noticed just like did not notice my problem. In the end, we lost all our matches, and he never spoke to me again, but I do not really care."], "tags": ["School"]},
{"name": "H. J. Granger", "date": "2nd June 2019", "text": ["I went to the doctor to be treated for a rash on my stomach. The doctor asked me to lift my shirt to show him the rash, which I did. He then roughly pushed me around and smacked my bum.", "\nI felt that it wasn’t severe enough to report. It’s been almost a year now and I feel that it’s too late, anyway."], "tags": ["doctor"]},
{"name": "Rose", "date": "2nd June 2019", "text": ["When I was 16, I was sitting in a starbucks’ reading a book, and wearing my favorite purple dress. It wasn’t at all a sexual dress, it tended to make me look younger rather than older, but it looked nice on me and I loved the color. While I was sitting there, a 30-40 year old man sat down next to me and started fiddling with his phone and looking rather suspicious. I kept looking down at my book and looking at him out of the corner of my eye. He eventually took a picture of me, and didn’t even turn the camera sound off. I don’t know why he felt entitled to take a picture of a stranger, let alone a teenage girl half his age. I wanted to confront him, but I didn’t because he was bigger and older. I stopped wearing my purple dress after that, and I am still mad I let the actions of a stupid stranger control me."], "tags": ["Public space"]},
{"name": "Lila", "date": "2nd June 2019", "text": ["When I was younger, I was in an all-boys cricket team. I quit after two years because I was sick and tired of being excluded from warm-ups, being insulted for being female, being made fun of if I made a mistake, and being compared to my younger brother, who is very sporty. I complained to my parents who told me, “You need to toughen up.” Later, when one boy, in particular, was impossible to deal with, I was told that he only picked on me because he liked me. So, I quit, and I really regret that. The more I think about it, the more I feel ashamed for letting them get to me, but I couldn’t deal with it. At the time, I was 13 and the boys in the team were 11/12 (girls played down a year)."], "tags": ["Public space"]},
{"name": "Interesting", "date": "2nd June 2019", "text": ["Has anyone noticed the trend of repeating a woman’s name when men violently disagree with her online?", "\nWhen two men disagree it’s less aggressive but also the mans name rarely gets mentioned, let alone repeatedly.", "\nIt’s weird – it reminds me of talking down to children when a parents just wants them to shut up.", "\nNo don’t do that", "\nV", "\nNo EMILY don’t do that Emily.", "\nI suspect it’s the same take down trick , shut up, I’m the authority.", "\nDoesn’t seem to happen between two women . ..", "\none to watch perhaps?"], "tags": ["Media", "Public space"]},
{"name": "Nice guys", "date": "2nd June 2019", "text": ["Just reading account of last person to be hanged in Australia and struck by how many men said he may have been innocent because he was “a nice guy.” And how he may have been stressed because his wife was leaving him.", "\nNo. Three armed robberies two previous convictions for fraud . Threatened a woman with death. That’s before the murder that got him hanged. That’s not a nice guy. Why do other men do this?", "\nJust seems so weird how many crimes you can commit and still get called a “nice guy” And how if your wife leaves you it’s your tragedy not your fault.. Historical news I know but it really reminded me of recent event – how many men tried to stick up fora local worthy who is acknowledged as a woman hating bully and has had two official warnings but guess what “he’s a nice guy whose wife just left him”  no thought as to why she’s just left. She’s left because he’s treated her badly I expect but no, that has become his tragedy and his excuse. Two official warnings and several unofficial ones! Nice guy!!!", "\nWoman looks at you with a hard face or says one horrible thing and she’s never labelled nice again…"], "tags": ["Media"]},
{"name": "anon", "date": "2nd June 2019", "text": ["I went out for a run on a sunny day, wearing shorts and a t-shirt, and I got stopped by a man on his way to a mosque and told that I should not be wearing shorts as I am asking for trouble. I was too out of breath to say anything, but I wish I had."], "tags": ["downwiththepatriarchy", "Public space"]},
{"name": "Henna", "date": "2nd June 2019", "text": ["I work in a shop whenever I am free as it’s the family business. And i’ve encountered so many things over the years. It’s just me and my mum so we take it in turns to be there by ourselves. I do nights because I don’t want my mum to encounter the drunk people. I was serving a customer who was so incredibly intrusive and kept asking me personal questions. Kept commenting on my body and asking if I could shut the shop and have a quickie at the back of it. I told him to leave but he wouldn’t. Eventually he did and I closed the shop. As I was leaving he was there on the other side of the road where my car was. I stood there for 5 mins and waited for him to clear off but he kept calling me over. I needed to go home so I walked towards my car and he grabbed me for a second but I managed to escape his grip. I never felt so scared in my life and the worst thing is I’ll have to see him again tomorrow when he comes in for his daily harassing."], "tags": ["Workplace"]},
{"name": "Katelin", "date": "2nd June 2019", "text": ["I didn’t realize I had been sexually assaulted multiple times in college until a few years later. There was the water polo guy, whom I had just met and wanted to kiss. And I went home with him but while we were on his bed he pinned me down with his hands around my neck. And I could not get out of his grip, though I tried. That was not intimacy or passion. It was power and dominance and ego. It was my first time feeling the true terror in realizing that I could be physically overpowered. And I cried on the way home with shame and fear and I didn’t tell anyone because I thought it was my fault for letting him think he could do that to me.", "There was also a guy who I invited home, but when I got home, I decided that I didn’t want to have sex. But he still went down on me and I told him to stop, pushed him away. But he kept going. And I gave in because I felt obligated not to disappoint him. I had brought him home with me after all. But giving in is not giving consent. I’ve since learned that consent is enthusiastic, specific (“yes to this, no to that”), and reversible. Women (and everyone, no matter how you identify) have the absolute right to rescind consent at any time. ", "I believed that I was at fault for letting these things happen to me. I should have been able to stop or prevent those experiences. And one guy that I trusted, in hearing my story, told me that “every girl has to deal with some assholes from time to time.” I internalized these types of messages. And it’s these messages that prevented me from realizing immediately in those moments that those were experiences of assault, and that it was not my fault."], "tags": ["School", "University"]},
{"name": "yun", "date": "2nd June 2019", "text": ["About half a year ago I had a very strong migraine attack that lasted throughout the night, so I hardly slept. In the morning I called my usual clinic, but they were fully booked and I badly needed a painkiller shot, so I had to visit a local practitioner I’ve never been to before. The moment I entered his office, he asked whether I had children, and immediately declared that my migraines were surely caused by a hormonal disfunction caused by not having any yet at 33 (he’s not seen any of my medical documentation). After I told him I’ve been having them for years and I’m not on birth control, he gave me the painkiller, but when I asked for a doctor’s leave for the day, which is something he should have advised himself (we don’t have sick days in my country, you need to get doctor’s recommendation), he faked being surprised that I work and started a mini-lecture on how I should quit my job right away, and use my womanly charms to have my husband work harder and make more money, because working is for men, and women are meant to be loved, stay at home and make the world prettier. I was too weak, tired and dumbfounded to respond, so I just smiled and left when he was done. I’ll never go to him again."], "tags": ["Healthcare"]},
{"name": "Daisy", "date": "2nd June 2019", "text": ["I’m 33, married and childless by choice. I made that decision may years ago, but until very recently no one took it seriously. People kept saying I’ll grow into it, my biological clock will start ticking, it’ll be different when I have my own, etc., all the usual.", "Unfortunately, that includes my own husband. I told him before we started dating, and he was able to accept the fact I didn’t want to give birth, but somehow interpreted my ‘I hate kids’ as ‘she hates babies’, and assumed ‘I don’t know if 4 years from now I slip on a staircase, hit my head and wake up wanting to adopt’ basically meant exactly 4 years later we would go and adopt a child.", "Fast forward 2 years, we’re married and he starts mocking me about that remark, reminding me of the “deadline”. I felt like I was sitting on a death row so I confronted him about it one day and found out that, actually, he really wanted children. Even though I told him I never wanted any and asked him to consider his options before we went on a first date, back then he brushed it off as unimportant, and later grabbed onto the 4 years countdown idea, which I now deeply regret ever voicing, eventhough I just wanted to be 100% realistic and fair.", "As you can imagine, this led to a marriage crisis. We got through it after much discussion and tears, but without a conclusion that would satisfy both sides. I wonder when this topic will resurface…", "My husband is a great man and I don’t regret a minute spent with him, but I wish he had taken me seriously and listened closely to what I had said from the start."], "tags": ["Home"]},
{"name": "Bea", "date": "2nd June 2019", "text": ["My line manager organises our ‘just for laughs’ company football team and is trying to find new players.", "\nThis morning he asked me if my boyfriend plays football, and ignored me when I said I had played before."], "tags": ["Workplace"]},
{"name": "james", "date": "2nd June 2019", "text": ["in my college, (yes, college), all of the girls were recently segregated off into a separate room, and told they will all be attending a trip to an old nursing home to “sing and dance” with the OAP’s there, despite knowing how “innappropriate” they are known to act there.", "As a gay trans male, why I am obselete here? Why am I disallowed from pleasuring these old citizens of our great country – because I’m tranz?", "It’s 2019, this is absurd."], "tags": ["barbados", "oap", "obselete", "old", "School", "st lucia", "tranz"]},
{"name": "vale", "date": "2nd June 2019", "text": ["in italy especially in the nort …are so sexists, that law do not cover women from bad husbands..them have to stay w the same one, because have no money to leave their home…and men would be glad if them go away(obviously this is a case who concern me),,,but no-body seems interest in this topic, or similar problems..also the lawyers dont really care much, obviously If there are not money involved…who cares..", "\nnice isnt’it?"], "tags": ["Media"]},
{"name": "Artsy", "date": "2nd June 2019", "text": ["My brother is a stay-at-home dad, while his wife works full time. He also works a couple of jobs on the side to support the household income. I feel like at times this is something my parents simply cannot get their heads around. Hearing them once refer to my brother as a ‘childminder’ really got to me, considering he is just as much The Parent as his other half. This assumption is doubly damaging, as in two strokes it underpins the notion that a father can’t be capable of being anything other than a fairweather caregiver – asked to babysit now and again but not generally expected to do any of the hard graft – and also points the finger of blame at the mother for not fulfilling her duty to be a 24/7 stay-at-home mother, even if this is not a feasible option."], "tags": []},
{"name": "Teresa", "date": "2nd June 2019", "text": ["“since we are a couple i dictate the rules so i can speak on her behalf” he blatantly texted this in a group chat with our neighbours. I get easily rattled about these type of remarks and ultimately make me see him for the sexist person he is. It’s not a joke because nobody laughed, it’s not a joke because i’m not a pawn in unfunny sexist masculine game. I wish i actually dated a man who respected me all the time and not a boy who still needs to act tough to feel secure."], "tags": ["Home"]},
{"name": "Emily", "date": "2nd June 2019", "text": ["A customer with whom I had never spoken before called in for assistance. He asked me if my husband had a college degree and was an educated man. I replied that he was. The (older, male) customer informed me that I was allowed to assist him because I must be intelligent or an educated man would not have married me. He then congratulated me on not being one of those “uppity women” that hyphenate their last names. I have a string of letters after my name but all he cared about was my husband’s bachelor degree."], "tags": ["Workplace"]},
{"name": "Mandi", "date": "2nd June 2019", "text": ["I’m an actress and my friend is working as a kind of production manager for a little independent short film project.  They needed someone for the part of ‘a professor/scientist’ so she recommended me to the director.  He was very reluctant because, “Do you really think a woman can play a professor?”"], "tags": ["actress acting film stem professor science", "Media"]},
{"name": "Z", "date": "2nd June 2019", "text": ["A kid in my grade, has a girlfriend, hitting on one of my friends. He has done this to multiple girls this year, while having the same girlfriend. Offhandly comments, ‘oh, she would be mad if she knew i was talking to other girls.’ Gives lewd winks and smiles to us, and when we get angry, ‘gals, I’m not mansplaining you, I’m just right’ says he is a huge supporter of gender equality. Yeah right. Nope. Prying into our personal lives, inquires about private group chats, says, “I’m your friend, that’s why it ok for me to know all about you.” Reached over to previously mentioned friend, pulls a hair, and says, “i’m gonna clone you. Maybe your clone will like me better” me and 2 other girls (both of whom he has hit on this year (cant help but think I’m next)) sit with him for 3 periods, and we are on a message stream together.", "\nWe are in 6th grade.", "\nI do highlands dance, which requires complicated costuming, but a basic for all the costumes is a lace dicky pinned underneath the collar. At festivals and competitions, girls will walk around in just their bras and their dickies, with their kilts, because man, those black velvet jackets get hot! Well, apparently were hot without the jackets too. Men will get richer s to a competition or a Scottish festival just to stand around watching dancers stand around and warm up in sports bras with lace pinned to them, and swingy kilts with nothing on under but a pair of black booty shorts."], "tags": ["bodywatchers", "creep", "He’sOnly12", "Mansplaining", "School", "Uncomfortable", "unsafe"]},
{"name": "Mandi", "date": "2nd June 2019", "text": ["I am very much a ‘tom-boy’as they say.  I often hate going to Home Depot (Lowes is better IMO) and auto repair stores. ", "At Home Depot I was looking for angle iron to mount solar panels to me van/RV. I HAD NOT told the HD worker what I was doing – not at all.  When I asked where I could find that he told me, “Oh, that won’t work for your project.”", "\n-_-", "\nI then asked him, “What is my project?”  Yeah, he was rightly embarrassed."], "tags": ["home depot repair", "Public space"]},
{"name": "Z", "date": "2nd June 2019", "text": ["My brother used to try to take showers with me, to have sleepovers with me, and i other stuff, and as a younger kid, i never thought anything of it. Now, he will randomly burst in on me while I’m undressing in my room, open the curtain while I’m showering, make weird comments on my developing body, and other weird stuff. When i have friends over, he will sit outside my door and listen to our conversations. He is 8, in second grade, and i am 12, in 6th grade. This is sort of creepy, and i wish he would stop. The thing is, he is emotionally delicate, and anything negative i say about him will make him have a meltdown. I tried telling him to go away when he walks in on me, i try telling him to stop listening to my conversations, to stop saying things like “i just noticed you have armpit hairs!” In public, but he doesn’t listen. I shouldn’t have to be scared of a boy who is 4 years younger and foot shorter than me. I tried telling my parents. They wont listen. “He’s only 8” “he just wants your company” “he looks up to you” no, he looks up my skirts. I’m not the only one who feels uncomfortable like this at home, but the thing is, when they are your family, they tend not to listen to you when you say no."], "tags": ["family", "He’sOnly8", "Home"]},
{"name": "Avery", "date": "2nd June 2019", "text": ["I live in a beach town so in the summer we get a lot of tourists. One day I was biking into the main shopping center and after being catcalled twice before (I was sixteen at the time) a car pulled up probably two feet from my bike the male college student honked his horn and shouted “What’s up hot stuff!” I was on a bike path and nearly swerved into the curb because the noise was so loud. I tried explaining this to one of my best friends and she asked me, “Why are you making such a big deal about this?”"], "tags": ["Public space"]},
{"name": "Arya", "date": "2nd June 2019", "text": ["Had my job mansplained to me by a colleague twice in two days, the same thing happened to another female colleague,apparantly he does this a lot and is very patronising and insulting to women in our department, it’s annoying because we’ve worked here for longer than him and have far higher qualifications."], "tags": ["University", "Workplace"]},
{"name": "Claire", "date": "2nd June 2019", "text": ["I work with 7 men 5 days a week.. They are like little school children .. They put me down at every opportunity, they try to tell me things that i already know. Then tell me im lying.  If i say to the Boss he didnt write something down in his notes for me to type, he accuses me of not reading them properly, he never laughs about it .. If i show him that they are not in the notes he glares/stares at me. To make me feel insecure and that its my fault..", "\nThere is worse but ile email anoher day."], "tags": ["Home", "Public Transport"]},
{"name": "Kathryn Bray Warner", "date": "2nd June 2019", "text": ["Hi", "\nI have a 4 yo daughter in a local village primary school; both myself and my husband work and I am proud (if a little exhausted) that I maintain my career in finance as well as have a family.", "\nI regularly, and regretfully, miss a lot of the parent interactions that are held in the middle of the working day but I was sure to take the afternoon off of work for the Mothers Day tea at 2pm on a Tuesday and was so happy when I saw my daughters face that I had managed to make the occasion.", "\nI was less happy two months later when we had the Father’s day equivalent, a breakfast that was very purposefully put at 8am in the morning so that daddies could still get to work without the inconvenience of taking a day out of their jobs, was sent out", "\nWhen i politely pointed out this inequality and the deliberate devaluing of women’s careers in the school i received no reply", "\nWhat message do we teach our daughters and sons about their respective values in the workplace when our teachers (working mothers themselves!) act in this way?"], "tags": ["School"]},
{"name": "Jasmin", "date": "2nd June 2019", "text": ["When I was 10 I took public transportation to school and home everyday, I would usually go on the bus with my mom after school except for one day. ", "My mom was running late for work so I decided to take the bus alone, this man around 50 stood behind me and started to whisper dirty things in my ear… I was so scared I didn’t know what to do or how to react. He ended up sliding his hand i my shirt and started to grope me. I’m 15 now and I’m still scared to take the bus alone."], "tags": ["Public Transport"]},
{"name": "Bree", "date": "2nd June 2019", "text": ["Boys keep saying girl can’t pick up this or that but I say girls can pick up everything and anything. The other day this boy said girls can only make sandwiches and fold clothes. I’m like boy you don’t know me I can do anything and mostly everything you do. Then i replied and “How about you go shut up and go play a video game.Girls can do anything we want so do what ever you want girls."], "tags": []},
{"name": "me", "date": "2nd June 2019", "text": ["I was at a field trip to a ball game and behind me, I heard some boys say “you like Jenna’s ass don’t you?” even worse she was in the same row as them when they said it and they knew it then when she said that she could hear them they said “I know”"], "tags": ["Public space", "School"]},
{"name": "Sophie", "date": "2nd June 2019", "text": ["First off, my real name isnt Sophie – its just a pseudonym. Anyways, im 15 years old (turning 16 pretty soon) and i play golf. Ive played golf for about 5 years now, and im getting pretty good. I have golf practice every monday where other juniors in the club meet up as well – i think we are about 22 in total and we are only 2 girls. Thats cool to me though, everyone is nice and helpfull – thats what i thought.", "So last monday i was at practice, just as usual. Then my coach (who is a male and about 30 years old) came up to me, and wanted to correct my swing. Apperantly he thougt, that i was holding on to the golf club too loose. He then got behind me, wrapped his arms around be and put his fingers in mine to show how i was supposed to hold on to it. Then he stepped back, and said to me “you know, its proberly because youre a woman, who was made to cook in a kitchen all day, and stir in pots that your grip is so loose” and then laughed out loud. All the other guys laughed really hard as well. Not only am i the only female there, im one of youngest as well (some of the guys are 25). I felt so uncomfortable. He had never touched me like that, or been so sexistic. ", "I met him randomly at the golf club yesterday, and he just sent me this weird smile, and talked so much with me and made plenty of jokes. That might not seem to weird, but he NEVER do that to the boys or just anyone else!", "So ive started to think about it, and only now do i come to the realization that im scared of him, and what he will do. i havent told my parents or anyone, cause what if im just overthinking it?"], "tags": ["Creepy", "golf", "Public space", "sparetime", "Workplace"]},
{"name": "Elle", "date": "2nd June 2019", "text": ["Male friend just told a story that centered around his mates in the pub looking at a woman in a low cut top. ", "So sick of this bullshit."], "tags": ["Public space"]},
{"name": "Mother and Professional", "date": "2nd June 2019", "text": ["Some of the most sexist women are professional women who never had children.   They are the worst women to work with if you are a professional woman who had, raised and celebrated your child’s success."], "tags": ["attorneys", "lawyers", "legal profession", "mothers", "Workplace"]},
{"name": "Kellie", "date": "2nd June 2019", "text": ["I was in nursing school at a state university at the time the event happened. As part of my studies, I had clinicals at a local hospital and cared for patients directly. While I was in the ICU for clinicals, I had a negative experience that stands out to me. ", "To adhere to HIPAA, all information will be de identified, and the patient in question will be referred to as “John Doe.”", "Mr. Doe was a post stroke patient, out of the proverbial woods, but still weak on one side. It was a textbook CVA case, and I was initially glad to have an “easier” patient. I started to feel uncomfortable, however, when I did my assessments and regular checks. Mr. Doe asked if I was in a relationship, if I’d date an older man. He called me “pretty,” “sweetheart,” and “hon.” I didn’t like it, but I was used to being harassed as a young nursing student.", "Later that day, I had to help transfer Mr. Doe for an imaging test. Essentially, I had to support his weak side so he could move safely to a wheelchair. During the transfer, Mr. Doe groped my buttocks and genitals over my clothes with his weak hand. I couldn’t get away from the touch without causing a fall, so I had to move Mr. Doe to his wheelchair while his hand was between my legs. ", "I felt dirty and used. I was a nursing student. My job was to provide healthcare and to make sure my patient was safe and healthy. Instead, I’d been treated like an object there for an old man’s sexual gratification.", "I handled the situation as I was trained to do. I reported the incident to my preceptor. She told me, “Older men like to flirt with the younger girls. It makes them feel young again.” I was appalled. My safety and well-being was clearly less important to my preceptor than my patient’s ability to assault me. Unfortunately, I did not report the incident to the hospital or to my university.", "Sexual violence against female healthcare providers is so common, it’s seen as part of the job. Nearly half of first year nurses leave the profession, and we have a critical nursing shortage nationwide. With experiences like mine commonplace, it’s not hard to see why."], "tags": ["Internalized Sexism", "Public space", "School", "sexual assault", "sexual harassment", "Sexual Violence Against Nurses", "University", "Workplace"]},
{"name": "that woman", "date": "2nd June 2019", "text": ["I’m needing to rent my spare room out. I don’t mind if I rent to a man or a woman, or anyone else, as long as they are a decent human being.", "\nA guy has made contact, he’s seems OK (mid-Sixties, professional), we chat on the phone, he views the room, he checks the wifi signal (which would be a deal-breaker for him, fair enough) we chat some more. All is good. He decides he wants to rent the space, we agree a moving in date, we start to do the paperwork.", "\nHe’s just texted me – ‘Wifi is GREAT and so are you. Its good to meet an attractive and intelligent lady.’", "\nMaybe he thinks he’s being gallant in an old-school kind of way – but, I just wish he hadn’t, is all. I’m going to be sharing my home with him. But I need the money, and this isn’t ‘odd’ enough for me to feel I have to back out and risk not finding someone else. Like I say, I just wish he hadn’t."], "tags": ["Home"]},
{"name": "Vivian Ashton", "date": "2nd June 2019", "text": ["I used to  work at a specialty food store at the register. It is located in a small town and we got a lot of older, creepy men. One day a new man in town started coming into the store. He was relatively kind at first. He did have a creepy stare however. The more often he came into the store, the creepier he got. eventually he started making sexually suggestive remarks to the female employees, two of which are 16. He got beer one day and looked up at my 16 year old coworker and said, “I wish I had a couple of you attractive ladies with me tonight” he then went on to give her a long stare up and down her body. It was hard to call him out because he was a customer and nobody wanted to make a big deal or get in trouble. It look a while of him coming in and making suggestive remarks, offering his member to employees, and making eye contact with our bodies instead of faces before anything was said to him or done about it. It made me feel very small, and objectified, and for the longest time I didn’t really think much about it. Finally after I had given my notice for other reasons, he came in one day. He made yet another comment to me and I looked up and said, “that is incredibly inappropriate. I don’t appreciate that at all.” and it gave me such a wave of fear and embarrassment that I didn’t expect to feel when defending myself. It’s funny the feelings that you don’t expect to surface when you actually approach pointing out sexist comments."], "tags": ["Public space", "Workplace"]},
{"name": "Ffs", "date": "2nd June 2019", "text": ["“My husband’s refusal to do housework almost ended our marriage”", "If you really think sexism isn’t still a problem just read the comments section under this telegraph article. It’s actually a bit scary. All but one of the comments are viciously anti female.", "\nOh and my relationship did end partly because of my partner refusing to do any housework once I’d signed up. Even when he was jobless and I was working. Even after 3 weeks in hospital. ", "Most men still don’t expect to do this and I hope I’m single the rest of my life.", "\nSeriously who has the time and the need to try to justify males doing nothing and expecting a skivvy?"], "tags": []},
{"name": "Enough", "date": "2nd June 2019", "text": ["“The gender discrimination is disgusting. Why do they make men’s shelters such a hell hole?”", "Comment about cleanliness in male and female shelters.. ummm.. “they” don’t, the men who stay there just won’t clean up after themselves. The women do.", "Meeeee tooo male victim hood at its finest .", "\nClean up after yourself, stop risk taking behaviour stay out of prison don’t be violent, and you’ll find all the alleged discrimination against homeless men disappears. It’s shitty male behaviour .", "\nI should know we have tried to house men who slept in cars etc they were hard to help and one said  that he shouldn’t have to clean up after himself because there was a woman there to do it! Me!", "\nOne refused to even flush the toilet and some men won’t even wash their hands. They shout more too.", "\nWomen without children are the most discriminated against in homeless situations in my experience.", "\nTired of this myth that men experience homeless discrimination there’s more of them because of the violence and risky behaviour.."], "tags": ["Home", "Public space"]},
{"name": "Snore", "date": "2nd June 2019", "text": ["This from Nora ", "“ particular type of sexism, the kind where men think they are owed a woman’s emotional labor, and at the same time think they are owed a woman’s submission to their views. ”", "Sums up a lot of my exhausting work day at 18 and years later with a male friend. Attention seeking males with long winded tabloid anecdotes about male victimhood (never their own story, because they hadn’t experienced enough sexism) saying “prove me wrong” yawn. They never listened and it was exhausting.", "\nI owe you nothing. Not my time, attention, nothing. Not wanting a debate doesn’t make you right. You weren’t listening, you had done no research,  and you weren’t intelligent."], "tags": ["Public space"]},
{"name": "Wrong", "date": "2nd June 2019", "text": ["My (now dumped) boyfriend came in and slapped me round the face as I was brushing my teeth “for a joke” then half apologised and said he hadn’t meant to do it quite so hard but I have “a slappable face”.", "\nI have now heard this phrase quite a few times about women a slappable .., (face/arse) never men. So it’s the fault of the person being slapped?", "\nYou read it online sometimes too.", "\nI’ve never heard this said about men.", "\nIf you mention it or any personal story to any man they immediately come up with a male-as- victim story that they read in a tabloid. Instead of just listening or sympathising. Because it’s 50/50 right? Wrong.", "\nWhy not just listen? If you criticise a woman everyone listens. If you criticise a man it gets batted back with an anecdote to neutralise it."], "tags": ["Public space"]},
{"name": "Great dad", "date": "2nd June 2019", "text": ["My friends husband watches pornography in front of their children – she has asked him repeatedly not to but he does.", "\nCan you imagine a woman doing this? It’s now the second time I’ve heard this situation.", "Now she does all the childcare as well as a full time job. It’s the only way to guarantee they don’t see vulgar stuff.  They already asking sexual questions well beyond what they should know. ", "Great dad, thanks for ruining my friends life with exhaustion and embarrassment.", "\nShe’s cleverer than him and given equal amounts of childcare duty would be earning a lot more but he’s wrecked it for her despite his promises of equality. It’s really all about him.", "\nShe thought he was the one because  he was soooo keen to get married and have kids ASAP. Mr domestic indeed.", "\nAnyone who thinks pornography is ok when it upsets their partner is a loser, dump them."], "tags": ["Home"]},
{"name": "Svenja", "date": "2nd June 2019", "text": ["I was 15. I was driving to a funfair in our town in Germany last summer. I was wearing an off the shoulder crop top and a jacket over it. Because of the jacket my top shiftet and after taking off my jacket, I pulled it a little bit down so that it would look properly. While I did that, two middle-aged guys watched me. Just as I was beginning to walk away, one of them called out: Hey, he (the other guy) wants to ask you something. I didn’t understand him that well, so out of reflex, I took a step towards them (they were standing 15-20m/50-65 feet away). Then the second guy said: I could help you with that, then I can pull it a little bit lower, too. (It sounded even more ridiculous in German, he said “Lass mich dir helfen, dann kann ich auch noch ein bisschen dran rumzuppeln”, but there isn’t really a good translation for the last word (maybe “play around”)). I was a little bit shocked and irritated, but I kept on walking. Later that afternoon, I regretted not replying with a f*ck you and a middle finger. I’ve felt uneasy and unsafe that whole day and every time I hear someone talking about cat calling etc these memories come back."], "tags": ["Public space"]},
{"name": "leila", "date": "20th May 2019", "text": ["Today I was cycling to school and a man stuck his head out of his car window and beeped at me. I am 16 trying to get an education."], "tags": ["School", "Workplace"]},
{"name": "Jo", "date": "20th May 2019", "text": ["After I did my short teacher training course I stayed in touch with several people. One guy I met up with on an irregular basis, purely as a friend. He was pretty geeky, but then so am I, so that was all fine. Then I found out from a mutual friend that he takes regular trips to the far East for sex tourism. The guy is in a wheelchair, so at first, even though the whole idea of exploiting impoverished women who have gone into prostitution in developing countries was obviously upsetting, I found myself making excuses for him to some extent. I know that this is not an excuse, however, plenty of people in wheelchairs have relationships, it is this man’s odious attitude to women that was the problem. Perhaps even worse, I found out that he upskirts women, and has probably done this in my presence when we went out, or has even done it to me. I cut off contact with him eventually, but it makes me sick to think that this man is teaching young women. I hope he has stopped paying to rape women and illegally violating their privacy with upskirting, which is thankfully now an offence in the UK."], "tags": ["education", "prostitution", "Public space", "Teacher", "University", "Upskirting", "Workplace"]},
{"name": "Jo", "date": "20th May 2019", "text": ["I was with my ex-boyfriend for several years, and every time we would meet with the rest of his family they would undermine me and make me feel small. He is one of three brothers who were all competitive with each other, but the way they extended this to me as a woman was exceptional. Every time I expressed an opinion on something – even something I had studied at Masters level and they had not – I was met with a ‘correction’ – which ironically showed only the level of their ignorance about the topic at hand. Their assumption of superiority was incredible. Unfortunately, this was also true of the mother, who assumed I was an airhead despite being the first in my family to go to university, obtaining the highest grades in my year in a number of subjects, and gaining a scholarship. She seemed to be obsessed with sizing me up physically instead, making comments about my body and would do the same to other women in a similar fashion. What was so surprising to me was that these were highly educated people, but their prejudice knew no bounds, and was deeply irrational, rooted in misogyny. I’m glad they never made it to in-law status, sometimes it’s good to look back and realise you’ve had a lucky escape."], "tags": ["In-laws", "Mansplaining", "Public space", "University", "Workplace"]},
{"name": "Jo", "date": "20th May 2019", "text": ["Sometimes little things are very telling. When I go to the supermarket, 9 times out of ten, the man in front of me at the checkout doesn’t put the shopping divider in place, it doesn’t even occur to them, they always expect me to do it. I have never noticed a woman not doing it. When a man does do it, I always think to myself ‘he must be a considerate chap’ and smile being somewhat reassured that not all men are so selfish – just 90% of them."], "tags": ["Public space", "Supermarket"]},
{"name": "Jo", "date": "20th May 2019", "text": ["I was on a flight coming back from Morocco with my boyfriend. I was in the middle seat with my boyfriend on one side and an older Moroccan man on the other. It is strictly taboo for men from his culture to touch women, but at one point he grabbed hold of my wrist quite unexpectedly to look at the time on my watch. He then manspreaded into my space the whole flight, leaning on me so that I was practically sitting in my boyfriend’s lap to get away from him touching me. Unfortunately I had another man also grab hold of my arm in the market place in Morocco, trying to insist I look at his stall. I found it was very deliberate, that they were being opportunistic because they see white women as ‘fair game’ to touch, even though I was there with my boyfriend. Very depressing that this was coming from an elderly man too."], "tags": ["flight", "manspreading", "Public Transport", "touching"]},
{"name": "Jo", "date": "20th May 2019", "text": ["I dropped by at an event after work at started talking to a group of people who were old friends (2 guys, one girl). They were in their mid-late twenties. We ended up chatting and getting more drinks and something to eat, then all ended up at the place of one of the guys with more drinks. The men then started trying to make me and the other girl make out with and have sex with each other. I told them I wasn’t a lesbian, and if I was that wouldn’t involve putting on a performance for them. They were shocked when I said perhaps the guys should have sex with each other so they could perform homosexuality for my entertainment, saying ‘that’s not the same’. They both grabbed hold of me at various point, one guy groping me between my legs, which I pushed off (If I was less drunk and if there wasn’t another woman there, I would have just run out of there, but as the evening had started out so civilised and with the other women being present I think I was confused – they had seemed so clean-cut!) At one point one of the guys locked me in his room and ‘ordered’ me to get undressed. I had already told him I wasn’t interested in him. He seemed to think this technique was what women want, that ‘no’ really means ‘yes’, just like in the movies. I told him in no uncertain terms that if he didn’t unlock the door right there and then I would scream the house down and start smashing up his room, and the neighbours would soon call the police, that I didn’t consent to anything and if he laid a finger on me I would consider it assault. Confronted with legal consequences he unlocked the door, and I’m glad to say I vomited all over his living room floor before getting the hell out of there."], "tags": ["assault", "coercion", "force", "Home"]},
{"name": "Jo", "date": "20th May 2019", "text": ["I was doing a Master’s degree and there were two older guys on the course who dominated every conversation. One of them was keen on trotting out sexist comments, his favourite ‘vanity, thy name is woman’. I hope they weren’t referring to me, seeing as I would ride in on my bike every day, in my casual clothes and often in the rain, in-between my working my two jobs. Oh, and I was also deliberately neglecting my appearance too, seeing as I had been traumatised by being violently sexually assaulted on the street a few months previous and was awaiting the court case to go to trial, so I didn’t want to look attractive anymore because I associated that with being sexually attacked. But yeah, sure, just insult women as vain and shallow like you know what’s going on in our lives, huh?"], "tags": ["University"]},
{"name": "Jo", "date": "20th May 2019", "text": ["One thing I’ve noticed when I’ve brought a guy back to my place for the first time is how they will go through my stuff, particularly feminine stuff such as makeup, and sneer at it derisively. I also happen to have a large collection of books and technical equipment such as Arduino, but they completely ignore that and instead look to belittle me for ‘spending so much on makeup’ (I don’t, I always buy the cheapest products as I don’t believe in ploughing my feminist dollar into the cosmetics industry, but even if I did that would be none of their business). It seems like these kinds of men who hate women for being so ‘shallow’ are the same ones who will rate women out of ten for their appearance – hypocritical much?"], "tags": ["dating", "Home", "makeup"]}
]