{
   "class_name": "Sequential",
   "config": {
      "name": "sequential_2",
      "layers": [
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_132",
               "trainable": true,
               "batch_input_shape": [
                  null,
                  224,
                  224,
                  3
               ],
               "dtype": "float32",
               "filters": 48,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_97",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_196",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_133",
               "trainable": true,
               "dtype": "float32",
               "filters": 96,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_97",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_98",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_197",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_134",
               "trainable": true,
               "dtype": "float32",
               "filters": 96,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_98",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_99",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_198",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_135",
               "trainable": true,
               "dtype": "float32",
               "filters": 96,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_99",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_100",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_199",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_136",
               "trainable": true,
               "dtype": "float32",
               "filters": 96,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_100",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_101",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_200",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_137",
               "trainable": true,
               "dtype": "float32",
               "filters": 96,
               "kernel_size": [
                  1,
                  1
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_101",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "MaxPooling2D",
            "config": {
               "name": "max_pooling2d_15",
               "trainable": true,
               "dtype": "float32",
               "pool_size": [
                  2,
                  2
               ],
               "padding": "valid",
               "strides": [
                  2,
                  2
               ],
               "data_format": "channels_last"
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_102",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_201",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_138",
               "trainable": true,
               "dtype": "float32",
               "filters": 144,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_102",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_103",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_202",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_139",
               "trainable": true,
               "dtype": "float32",
               "filters": 144,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_103",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_104",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_203",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_140",
               "trainable": true,
               "dtype": "float32",
               "filters": 144,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_104",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_105",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_204",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_141",
               "trainable": true,
               "dtype": "float32",
               "filters": 144,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_105",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_106",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_205",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_142",
               "trainable": true,
               "dtype": "float32",
               "filters": 144,
               "kernel_size": [
                  1,
                  1
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_106",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "MaxPooling2D",
            "config": {
               "name": "max_pooling2d_16",
               "trainable": true,
               "dtype": "float32",
               "pool_size": [
                  2,
                  2
               ],
               "padding": "valid",
               "strides": [
                  2,
                  2
               ],
               "data_format": "channels_last"
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_107",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_206",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_143",
               "trainable": true,
               "dtype": "float32",
               "filters": 192,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_107",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_108",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_207",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_144",
               "trainable": true,
               "dtype": "float32",
               "filters": 192,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_108",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_109",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_208",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_145",
               "trainable": true,
               "dtype": "float32",
               "filters": 192,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_109",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_110",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_209",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_146",
               "trainable": true,
               "dtype": "float32",
               "filters": 192,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_110",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_111",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
