{
   "class_name": "Sequential",
   "config": {
      "name": "sequential_1",
      "layers": [
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_34",
               "trainable": true,
               "batch_input_shape": [
                  null,
                  224,
                  224,
                  3
               ],
               "dtype": "float32",
               "filters": 48,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_1",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_99",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_35",
               "trainable": true,
               "dtype": "float32",
               "filters": 112,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_1",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_2",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_100",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_36",
               "trainable": true,
               "dtype": "float32",
               "filters": 112,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_2",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_3",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_101",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_37",
               "trainable": true,
               "dtype": "float32",
               "filters": 112,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_3",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_4",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_102",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_38",
               "trainable": true,
               "dtype": "float32",
               "filters": 112,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_4",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_5",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_103",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_39",
               "trainable": true,
               "dtype": "float32",
               "filters": 112,
               "kernel_size": [
                  1,
                  1
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_5",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "MaxPooling2D",
            "config": {
               "name": "max_pooling2d_10",
               "trainable": true,
               "dtype": "float32",
               "pool_size": [
                  2,
                  2
               ],
               "padding": "valid",
               "strides": [
                  2,
                  2
               ],
               "data_format": "channels_last"
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_6",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_104",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_40",
               "trainable": true,
               "dtype": "float32",
               "filters": 192,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_6",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_7",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_105",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_41",
               "trainable": true,
               "dtype": "float32",
               "filters": 192,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_7",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_8",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_106",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_42",
               "trainable": true,
               "dtype": "float32",
               "filters": 192,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_8",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_9",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_107",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_43",
               "trainable": true,
               "dtype": "float32",
               "filters": 192,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_9",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_10",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_108",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_44",
               "trainable": true,
               "dtype": "float32",
               "filters": 192,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_10",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_11",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_109",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_45",
               "trainable": true,
               "dtype": "float32",
               "filters": 192,
               "kernel_size": [
                  1,
                  1
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_11",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "MaxPooling2D",
            "config": {
               "name": "max_pooling2d_11",
               "trainable": true,
               "dtype": "float32",
               "pool_size": [
                  2,
                  2
               ],
               "padding": "valid",
               "strides": [
                  2,
                  2
               ],
               "data_format": "channels_last"
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_12",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_110",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_46",
               "trainable": true,
               "dtype": "float32",
               "filters": 304,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_12",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_13",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_111",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_47",
               "trainable": true,
               "dtype": "float32",
               "filters": 304,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_13",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_14",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "beta_constraint": null,
               "gamma_constraint": null
            }
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_112",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            }
         },
         {
            "class_name": "Conv2D",
            "config": {
               "name": "conv2d_48",
               "trainable": true,
               "dtype": "float32",
               "filters": 304,
               "kernel_size": [
                  3,
                  3
               ],
               "strides": [
                  1,
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1,
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                     "scale": 2.0,
                     "mode": "fan_in",
                     "distribution": "uniform",
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            }
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_14",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.2,
               "noise_shape": null,
               "seed": null
            }
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_15",
               "trainable": true,
               "dtype": "float32",
               "axis": 1,
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "gamma_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
